import { HeroSection } from "@/components/HeroSection";
import { AboutSection } from "@/components/AboutSection";
import { IndustrialFloorsIntroSection } from "@/components/IndustrialFloorsIntroSection";
import { MaterialSelectionSection } from "@/components/MaterialSelectionSection";
import { TypesSection } from "@/components/TypesSection";
import { BenefitsSection } from "@/components/BenefitsSection";
import { StepsSection } from "@/components/StepsSection";
import { ContactSection } from "@/components/ContactSection";

export default function Home() {
  return (
    <div className="bg-zinc-50">
      <HeroSection />
      <main className="mx-auto max-w-5xl px-4 pb-10 pt-8 sm:px-6 lg:px-8 lg:pb-16">
        <IndustrialFloorsIntroSection
          imageSrc="/promyshlennye-poly.jpg"
          imageAlt="Промислові бетонні підлоги"
          imagePosition="70% 50%"
          imageSide="left"
          paragraphs={[
            "Термін «підлога» слід розуміти як обробку горизонтальної перегородки конструкції, що надає їй необхідні функціональні властивості. Підлога складається з: гідроізоляційних шарів, пароізоляції, тепло- і звукоізоляції, захисних шарів, несучих шарів (бетонів, стяжок), обраних в залежності від навантаження, типу приміщення і відповідних вимог до використання. З іншого боку, підлога – це верхній шар, який переносить функціональні навантаження на будівельні шари і / або захищає його від пошкоджень, викликаних агресивним середовищем і / або.",
            
          ]}
        />
        <IndustrialFloorsIntroSection
          imageSrc="/poly.jpg"
          imageAlt="Бетонна підлога"
          imagePosition="70% 50%"
          imageSide="right"
          paragraphs={[
            "Термін «підлога» слід розуміти як обробку горизонтальної перегородки конструкції, що надає їй необхідні функціональні властивості. Підлога складається з: гідроізоляційних шарів, пароізоляції, тепло- і звукоізоляції, захисних шарів, несучих шарів (бетонів, стяжок), обраних в залежності від навантаження, типу приміщення і відповідних вимог до використання. З іншого боку, підлога – це верхній шар, який переносить функціональні навантаження на будівельні шари і / або захищає його від пошкоджень, викликаних агресивним середовищем і / або.",
          ]}
        />
        <MaterialSelectionSection
          title="Вибір матеріалу для промислової підлоги"
          paragraphs={[
            "Основною умовою тривалої безперебійної експлуатації підлоги є прийняття технічно правильного рішення за матеріалом, пов’язаного не тільки з самою підлогою, але і з шарами конструкції підлоги.",
            "Мова йде не тільки про здатність нести експлуатаційні навантаження (механічні – від тиску в колесі, гальмівних сил, динамічних, від ударів; теплові, наприклад, в холодильних камерах або на відкритих парковках; хімічні і т. Д.), але також про експлуатаційну безпеку.",
            "З огляду на те, що підлога повинна взаємодіяти з іншими елементами конструкції будівлі (наприклад, колонами, стінами), необхідно не тільки його заливати, а й герметизувати жолоби, правильно конструювати і часто герметизувати будівельні, зони або крайові компенсатори. На етапі проектування проектувальник повинен враховувати всі фактори, які впливають на поведінку конструкції підлоги під час експлуатації.",
          ]}
          items={[
            "Бетонна підлога: Бетонна підлога з одним з найпоширеніших видів промислових підлог. Вона має високу міцність, стійкість до зносу та важких навантажень. Бетонні підлоги можуть бути оброблені для підвищення стійкості до хімічних реагентів, вологості та зносу.",
            "Епоксидна підлога: Епоксидні покриття володіють високою стійкістю до хімічних реагентів, агресивних середовищ та зносу. Вони легко миються і дезінфікуються, тому часто використовуються в промислових кухнях, лабораторіях та інших місцях з високими вимогами до гігієни.",
            "Поліуретанова підлога: Поліуретанові підлоги мають високу міцність та стійкість до хімічних реагентів. Вони також вологостійкі та можуть витримувати високі температури, тому часто використовуються в промислових об’єктах з високою вологістю або температурним режимом.",
          ]}
        />
        <MaterialSelectionSection
          title="Особливості промислових бетонних підлог"
          paragraphs={[
            "Промислові бетонні підлоги мають деякі особливості, які роблять їх популярними в промислових, комерційних та громадських приміщеннях.",
          ]}
          items={[
            "Бетонна підлога: Бетонна підлога з одним з найпоширеніших видів промислових підлог. Вона має високу міцність, стійкість до зносу та важких навантажень. Бетонні підлоги можуть бути оброблені для підвищення стійкості до хімічних реагентів, вологості та зносу.",
            "Епоксидна підлога: Епоксидні покриття володіють високою стійкістю до хімічних реагентів, агресивних середовищ та зносу. Вони легко миються і дезінфікуються, тому часто використовуються в промислових кухнях, лабораторіях та інших місцях з високими вимогами до гігієни.",
            "Поліуретанова підлога: Поліуретанові підлоги мають високу міцність та стійкість до хімічних реагентів. Вони також вологостійкі та можуть витримувати високі температури, тому часто використовуються в промислових об’єктах з високою вологістю або температурним режимом.",
          ]}
        />
        {/* <AboutSection />
        <TypesSection />
        <BenefitsSection />
        <StepsSection />
        <ContactSection /> */}
      </main>
    </div>
  );
}
